// Задача 2. Теперь давайте сделаем функцию, которая вычислит сумму всей покупки. Дайте функции понятное название и добавьте такие правила: нужно проверять, является ли цена числом (при помощи typeof), суммируем только положительные цены, а если находим не число или отрицательное число, то выдаем ошибку при помощи throw.

// В ходе выполнения задания, поищите в интернете документацию по for..of, throw, condole.log, функциям и массивам. Лучше всего искать в MDN (mozilla developers network).

// Добейтесь, чтобы код запускался в командной строке через node.js или в браузере.
